/**
******************************************************************************
* @file    ModBus_user.h
* @author  Yu
* @version V1.0
* @date    2018年5月31日
* @brief   TODO(用一句话描述该文件做什么)
******************************************************************************
* @attention
*
*
*
******************************************************************************
*/
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MODBUS_USER_H_
#define MODBUS_USER_H_
/* Includes ------------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
void Reply_01(void);     	//处理读线圈请求(0x设备类型)，  可读可写
void Reply_02(void);     	//处理读离散量请求(1x设备类型)，只能读
void Reply_03(void);     	//处理读保持寄存器(3x设备类型)
void Reply_04(void);     	//处理读输入寄存器(4x设备类型)
void Reply_05(void);     	//处理写单个线圈请求
void Reply_06(void);     	//处理写单个保持寄存器请求



#endif /* MODBUS_USER_H_ */
/******************* (C) COPYRIGHT YuRobo *****END OF FILE****/
